# Найдите сумму цифр трехзначного числа.

x = 123

a = x % 10
b1 = x// 10
b2 = b1 % 10
c = x // 100

sum = a + b2 + c
print(f" {a} + {b2} + {c} = {sum}")